## PAIR PROGRAMMING - PANDAS 1

In [2]:
import pandas as pd
import numpy as np

-  Empezamos los ejercicios de pair programming con Pandas. En esta lecci√≥n hemos aprendido que son las Series y DataFrames y como podemos crearlos en Python.
El objetivo de la clase de hoy ser√° crear unos cu√°ntos DataFrames y Series a trav√©s de los siguientes ejercicios:


### 1.¬øQu√© diferencia hay entre una Serie y un DataFrame?


RESPUESTA --> una Serie es unidimensional y un Dataframe es multidimensional.

### 2. Momento de trabajar con Series. Contestad a las siguientes preguntas:

Crea dos listas:
Una que se llame "valores" que tenga 7 n√∫meros aleatorios.
Otra que se llame "indices" que tenga 7 strings que se llamen como los d√≠as de la semana.

In [3]:

valores = [34, 2, 6, 45, 9, 12, 7]

indices = ['lunes', 'martes', 'miercoles', 'jueves', 'viernes', 'sabado', 'domingo']

A partir de estas dos listas cread una Serie donde la variable "valores" sean los valores de la Serie y la variable indices sean los √≠ndices de la Serie.

In [4]:

Serie = pd.Series(valores, index=indices)

A partir de las dos listas anteriores cread un diccionario usando un bucle for. Para hacer esto tenemos el m√©todo zip que nos permite iterar por dos listas a la vez. M√°s informaci√≥n sobre este m√©todo aqu√≠.

In [5]:

dicc = {}
for idx in range(len(indices)):
    dicc[indices[idx]] = valores[idx]

print(dicc)

{'lunes': 34, 'martes': 2, 'miercoles': 6, 'jueves': 45, 'viernes': 9, 'sabado': 12, 'domingo': 7}

Crea una Serie con el diccionario creado en el punto anterior.

In [6]:
Serie1 = pd.Series(dicc)
print(Serie1)

lunes        34
martes        2
miercoles     6
jueves       45
viernes       9
sabado       12
domingo       7
dtype: int64

¬øQu√© forma tiene esta √∫ltima Serie?

In [7]:
Serie1.shape

(7,)

¬øQu√© tipo de datos tiene?

In [8]:

Serie1.dtype

dtype('int64')

¬øQu√© tama√±o tiene?

In [9]:

Serie1.size

7

¬øCu√°les son los √≠ndices de la Serie?

In [10]:

Serie1.index

Index(['lunes', 'martes', 'miercoles', 'jueves', 'viernes', 'sabado',
       'domingo'],
      dtype='object')

¬øY los values?

In [11]:

Serie1.values

array([34,  2,  6, 45,  9, 12,  7])

Extraed el valor para el √≠ndice "lunes"

In [12]:
Serie1['lunes']

34

Extraed el valor para el √≠ndice "lunes", "martes" y "mi√©rcoles".

In [13]:
Serie1[['lunes', 'martes', 'miercoles']]

lunes        34
martes        2
miercoles     6
dtype: int64

Extraed el valor para el √≠ndice "lunes" y "domingo".

In [14]:

Serie1[['lunes', 'domingo']]

lunes      34
domingo     7
dtype: int64

### 3. Es el turno de los DataFrames

Cread un array de dos dimensiones con 4 filas y 3 columnas.

In [15]:
array1 = np.random.randint(1, 7, (4, 3))
print(array1)

#Comprobamos que se ha creado correctamente y que es de dimensi√≥n 2
array1.ndim

[[6 5 4]
 [1 2 3]
 [6 2 4]
 [5 5 3]]

2

Convertid el array en un DataFrame donde las columnas se llamen "Espa√±a", "Francia" e "Italia".

In [16]:

df1 = pd.DataFrame(array1, columns = ['Espa√±a', 'Francia', 'Italia'])
print(df1)

   Espa√±a  Francia  Italia
0       6        5       4
1       1        2       3
2       6        2       4
3       5        5       3

Descargad el archivo "medallas" y cargad el DataFrame con la siguiente l√≠nea de c√≥digo:

In [19]:
df = pd.read_csv("datos/medallas.csv", index_col=["Pa√≠s"])

In [20]:
print(df)

                 Unnamed: 0   Oro  Plata  Bronce
Pa√≠s
China                     1  1473    994     720
Jap√≥n                     2  1032   1037     985
Corea del Sur             3   745    663     827
Ir√°n                      4   179    181     197
Kazajist√°n                5   155    158     224
India                     6   154    202     315
Tailandia                 7   132    175     278
Indonesia                 8   112    131     240
China Taip√©i              9    99    144     276
Corea del Norte          10    91    120     235

üìå NOTA Para evitar problemas guardar el archivo medallas.csv a la misma altura (en la misma carpeta) que el jupyter donde estamos trabajando.

Usando el loc extraed todas las columnas de la fila de Tailandia.

In [21]:
df.loc['Tailandia', :]

Unnamed: 0      7
Oro           132
Plata         175
Bronce        278
Name: Tailandia, dtype: int64

Usando el loc extraed todas las columnas de China e Ir√°n.

In [22]:

df.loc[['China', 'Ir√°n'], :]

       Unnamed: 0   Oro  Plata  Bronce
Pa√≠s
China           1  1473    994     720
Ir√°n            4   179    181     197

Usando el loc extraed solo las columnas de "Oro", "Plata" y "Bronce" de China e Ir√°n.

In [23]:

df.loc[['China', 'Ir√°n'],['Oro', 'Plata','Bronce']]

        Oro  Plata  Bronce
Pa√≠s
China  1473    994     720
Ir√°n    179    181     197

Usando el iloc extraed la informaci√≥n de la India. Devolved todas las columnas.

In [24]:
#la India corresponde con el √≠ndice 6

df.iloc[6, :]

Unnamed: 0      7
Oro           132
Plata         175
Bronce        278
Name: Tailandia, dtype: int64

Usando el iloc extraed todas las columnas de los paises que est√©n en posici√≥n impar. La primera que nos tendr√≠a que salir es Jap√≥n y la √∫ltima Corea del Norte.

In [25]:
df.iloc[1::2,:]

                 Unnamed: 0   Oro  Plata  Bronce
Pa√≠s
Jap√≥n                     2  1032   1037     985
Ir√°n                      4   179    181     197
India                     6   154    202     315
Indonesia                 8   112    131     240
Corea del Norte          10    91    120     235

Utilizando el c√≥digo del ejercicio anterior, seleccionad unicamente las columnas "Oro", "Plata" y "Bronce".

In [32]:
df.iloc[1::2 , 0:]

                  Oro  Plata  Bronce
Pa√≠s
Jap√≥n            1032   1037     985
Ir√°n              179    181     197
India             154    202     315
Indonesia         112    131     240
Corea del Norte    91    120     235

Contestad a las siguientes preguntas:
- ¬øQu√© pa√≠s consigui√≥ m√°s de 200 medallas de oro?
- ¬øQu√© pa√≠s consigui√≥ m√°s de 200 medallas de oro y m√°s de 1000 de plata?
- ¬øQu√© pa√≠s consigui√≥ m√°s de 200 medallas de oro o m√°s de 700 de bronce?

In [ ]:
df.loc[df.Oro> 200]
df.loc[(df['Oro']>200) & (df['Plata']>1000)]
df.loc[(df['Oro']>200) | (df['Bronce']>700)]

               Unnamed: 0   Oro  Plata  Bronce
Pa√≠s
China                   1  1473    994     720
Jap√≥n                   2  1032   1037     985
Corea del Sur           3   745    663     827

Como vemos hay una columna que se llama Unnamed: 0 que no nos interesa. Eliminad esa columna.

In [28]:

df = df.drop("Unnamed: 0", axis=1)
df

                  Oro  Plata  Bronce
Pa√≠s
China            1473    994     720
Jap√≥n            1032   1037     985
Corea del Sur     745    663     827
Ir√°n              179    181     197
Kazajist√°n        155    158     224
India             154    202     315
Tailandia         132    175     278
Indonesia         112    131     240
China Taip√©i       99    144     276
Corea del Norte    91    120     235

Cread una nueva columma que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada pa√≠s.

In [29]:

df.assign(Total = df["Oro"] +df["Plata"] +df["Bronce"])

                  Oro  Plata  Bronce  Total
Pa√≠s
China            1473    994     720   3187
Jap√≥n            1032   1037     985   3054
Corea del Sur     745    663     827   2235
Ir√°n              179    181     197    557
Kazajist√°n        155    158     224    537
India             154    202     315    671
Tailandia         132    175     278    585
Indonesia         112    131     240    483
China Taip√©i       99    144     276    519
Corea del Norte    91    120     235    446